Revit 2027 API
BuiltInFailures.CurveFailures.CurveNotEditableWarn Property
 Lines created by massing or picking 3d path are not editable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveNotEditableWarn { get; }
Public Shared ReadOnly Property CurveNotEditableWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveNotEditableWarn {
	FailureDefinitionId^ get ();
}
static member CurveNotEditableWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace